tests/org.jboss.tools.switchyard.ui.bot.test/resources/messages/Hello/Hello_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:com.example.switchyard:test:1.0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:sayHello>
         <urn:string>apodhrad</urn:string>
      </urn:sayHello>
   </soapenv:Body>
</soapenv:Envelope>